artillery_toptracks.yml
config:
  target: 'http://localhost:3000/tracks'
  plugins:
    expect: {}
  phases:
    - duration: 60
      arrivalRate: 1000
scenarios:
  - name: Get top tracks
    flow:
      - get:
          url: '/top'
          # capture:
          #   - json: 'name'
          expect:
            - statusCode: 200
            - contentType: json
            # - hasProperty: "name"
            # - equals:
            #     - "Standing Yellow Flannel"